import streamlit as st

# Настройка параметров данной страницы
st.set_page_config(
    page_title="Домашняя", # Текст на вкладке браузера
    page_icon='👨',       # Иконка на вкладке браузера
    layout="wide",        # Использовать всю ширину страницы
    initial_sidebar_state="expanded",  # Раскрыть боковую панель
)

# Создать объект - страница
pg_company = st.Page(page="pages/about.py", title="👨‍💼О компании")

# Создать боковую панель
sb = st.sidebar
with sb:
    # Создать ссылки на страницы
    st.page_link("pages/page1.py", label="Страница 1", icon="1️⃣")
    st.page_link(pg_company, label="О компании", icon="👷🏼")
    st.page_link("https://dzen.ru", label="Яндекс", icon="🌎")