import streamlit as st

# Создание простой кнопки primary
bt_1 = st.button("Привет", type="primary")
if bt_1:
    st.write("Нажата кнопка 'Привет'")

# Создание простой кнопки secondary
bt_2 = st.button("Выход")
if bt_2:
    st.write("Нажата кнопка 'Выход'")
else:
    st.write("Приложение загружено")

# Создание простой кнопки tertiary
bt_3 = st.button("Текстовая кнопка", type="tertiary")
if bt_3:
    st.write("Нажата текстовая кнопка")

# Создание колонок
left, middle, right = st.columns(3)
# Создание кнопок в колонках
if left.button("Простая кнопка", width="stretch"):
    left.markdown("Нажата простая кнопка")
if middle.button("Кнопка с эмодзи", icon="😃", width="stretch"):
    middle.markdown("Нажата кнопка с эмодзи")
if right.button("Кнопка с иконкой", icon=":material/mood:", width="stretch"):
    right.markdown("Нажата кнопка с иконкой")