import streamlit as st

# Колонка
bt = st.button("Выдать сообщения")
if bt:
    st.success('Загрузка данных выполнена успешно!',
               icon="✅",
               width=400)
    st.info('Приветствуем вас на странице академии Python',
            icon="ℹ️", width=400)
    st.warning('Внимание, данные будут удалены',
               icon="⚠️",
               width=300)
    st.error('Ошибка выполнения программы!',
             icon="🚨",
             width=300)
    e = RuntimeError("Это исключение типа RuntimeError")
    st.exception(e, width=300)