import streamlit as st

st.text('Элемент st.popover')

# Включение элементов в контейнер через with
pop = st.popover("Электронный адрес")
with pop:
    st.markdown("Добрый день 👋")
    email = st.text_input("Введите ваш электронный адрес")

st.write("Ваша почта:", email)

# Включение элементов в контейнер через метод объекта
popover = st.popover("Фильтр цветов шрифта")
red = popover.checkbox("Включить красный цвет", False)
blue = popover.checkbox("Включить синий цвет", False)

if red:
    st.write(":red[Доступен красный цвет.]")
if blue:
    st.write(":blue[Доступен синий цвет.]")

# Включение элементов в контейнер через with
with st.popover("Показать график Pandas", width="stretch"):
    st.bar_chart({"data": [1, 5, 2, 6, 2, 1]})